read -sv /Users/ludwigcron/Documents/Projets/generic_sar/tb.sv
read_verilog /Users/ludwigcron/Documents/Projets/generic_sar/sar.v
read -sv /Users/ludwigcron/Documents/Projets/generic_sar/sar_analog.sv
read_verilog /Users/ludwigcron/Documents/Projets/generic_sar/sar_reconstruction.v
read_verilog /Users/ludwigcron/Documents/Projets/generic_sar/generic/toggle_resync.v
read_verilog /Users/ludwigcron/Documents/Projets/generic_sar/generic/rs_nand.v
read_verilog /Users/ludwigcron/Documents/Projets/generic_sar/generic/rs_nor.v
COV_MODULES	:	sar
IP_MODULES	:	port
COV_FLAGS	:	-DEFINE COVERAGE -NOWARN PSEFM
SIM_FLAGS	:	-DEFINE FOR_SIMULATION
hierarchy -check -top mytop
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty mycells.lib
abc -liberty mycells.lib
clean
write_verilog out.v
